//
//　2つの値を加えるとき、その大きさの差がfloatの有効桁を超えたとき、
// 小さい値が無視されてしまう
//


#include <stdio.h>
#include <stdlib.h>
#include <math.h>

int main(int argc, char *argv[]){
	float a, b, c;
	a = 9.99e-1;
	b = 1.23456;
	c =a+b;

	printf("\t%15e\t+\t%15e\t=\t%15e\n",a,b,c);
	for(int i=0;i<8;++i){
		a/=10.0;
		c =a+b;
		printf("\t%15e\t+\t%15e\t=\t%15e\n",a,b,c);
	}



}
/*
           9.990000e-01 +          1.234560e+00 =          2.233560e+00
           9.990000e-02 +          1.234560e+00 =          1.334460e+00
           9.990000e-03 +          1.234560e+00 =          1.244550e+00
           9.990000e-04 +          1.234560e+00 =          1.235559e+00
           9.990000e-05 +          1.234560e+00 =          1.234660e+00
           9.990001e-06 +          1.234560e+00 =          1.234570e+00
           9.990001e-07 +          1.234560e+00 =          1.234561e+00
           9.990001e-08 +          1.234560e+00 =          1.234560e+00
           9.990002e-09 +          1.234560e+00 =          1.234560e+00
*/
